[
  {
    "title": "Market Watch",
    "link": "https://github.com/hardik-kapadia/stock-portfolio-management",
    "tags": [
      "java",
      "spring",
      "spring-boot",
      "mysql",
      "sql",
      "api",
      "rest-api"
    ],
    "displayTags": [
      "Java",
      "Spring Boot",
      "MySQL",
      "Rest API"
    ],
    "categories": [
      "swe"
    ],
    "heading": "A Complete back-end for a Stock Market portfolio application",
    "description": "A stock portfolio management app that offers users real-time investment tracking through integrated Finance APIs. With robust data protection and authentication measures, users can safely monitor their portfolios, making informed decisions to maximize their gains.",
    "thumbnail": "market-watch-logo.jpg",
    "rank": 3
  },
  {
    "title": "Uni-link",
    "link": "https://github.com/hardik-kapadia/unilink-backend",
    "tags": [
      "python",
      "dart",
      "flutter",
      "fastapis",
      "tensorflow",
      "apis"
    ],
    "displayTags": [
      "Python",
      "Dart",
      "Flutter",
      "FastAPI",
      "Tensorflow"
    ],
    "categories": [
      "swe",
      "ml",
      "mobile"
    ],
    "heading": "Unified marketing solution for social media managers and small businesses",
    "description": "Unilink revolutionizes social media management, offering a multi-platform solution that cuts posting time by 60%. With seamless API integration, secure login, and a user-centric design, it streamlines your workflow across all major social networks.",
    "thumbnail": "uni-link-logo.png",
    "rank": 2
  },
  {
    "title": "Stonks",
    "link": "https://github.com/hardik-kapadia/stonks",
    "tags": [
      "python",
      "finance",
      "nlp",
      "apis",
      "natural-language-processing",
      "twitter",
      "data-mining",
      "nltk",
      "flair",
      "django"
    ],
    "displayTags": [
      "Python",
      "Django",
      "NLP",
      "Data minings"
    ],
    "categories": [
      "swe",
      "ml"
    ],
    "heading": "Stock Market Prediction using Social Media Sentiment",
    "description": "Developed during a hackathon, this innovative web app leverages Twitter and Finance APIs to predict stock prices. By combining natural language processing of tweets with historical market data, it offers dynamic forecasts based on social media sentiment and past performance",
    "thumbnail": "project-1.png",
    "rank": 3
  },
  {
    "title": "ReImagine",
    "link": "https://github.com/hardik-kapadia/ReImagine-App",
    "tags": [
      "dart",
      "flutter",
      "reddit",
      "art",
      "apis",
      "firebase",
      "sqlite"
    ],
    "displayTags": [
      "Flutter",
      "Reddit API",
      "Firebase",
      "SQLite"
    ],
    "categories": [
      "mobile"
    ],
    "heading": "A Cross-platform application to browse and download curated art posts from reddit",
    "description": "ReImagine is an intuitive app that allows users to explore and save curated art from Reddit's Imaginary Network Expanded (INE) group of subreddits. The apps's simple and secure authentication lets users enjoy a seamless browsing experience, discover new artists, and easily organize their favorite posts.",
    "thumbnail": "project-2.png",
    "rank": 6
  },
  {
    "title": "Book 'S' Mart",
    "link": "https://github.com/hardik-kapadia/BookSMart",
    "tags": [
      "java",
      "android",
      "aws",
      "sql",
      "mysql",
      "apis"
    ],
    "displayTags": [
      "Android",
      "AWS",
      "MySQL",
      "Java"
    ],
    "categories": [
      "swe",
      "mobile"
    ],
    "heading": "An Android App to exchange books",
    "description": "A multi-platform social media management application that enables users to manage their social media profiles accross multiple social platforms from a single unified app. Allowed users to post, view statistics, and curate their content curation strategy using trained Convolutional and Recurrent neural networks embedded within the app",
    "thumbnail": "booksmart-logo.jpg",
    "rank": 5
  },
  {
    "title": "Telegram GPT Bot",
    "link": "https://github.com/hardik-kapadia/Telegram-bot-local-gpt",
    "tags": [
      "python",
      "ai",
      "telegram",
      "bot",
      "langchain",
      "speech",
      "gpt",
      "chatgpt",
      "text"
    ],
    "displayTags": [
      "Python",
      "GPT",
      "LangChain",
      "Google speech"
    ],
    "categories": [
      "swe",
      "ml"
    ],
    "heading": "A multi-lingual telegram bot bringing AI to the masses",
    "description": "A GPT-powered multilingual Telegram bot which assists underprivileged farmers with agricultural queries, bridging language barriers and improving information accessibility. Users can send voice note queries in any language, receiving responses as both text and AI-generated voice notes, enhancing overall usability and reach.",
    "thumbnail": "telegram-gpt-logo.png",
    "rank": 2
  },
  {
    "title": "Discord bot",
    "link": "https://github.com/hardik-kapadia/discord-bot",
    "tags": [
      "python",
      "api",
      "github",
      "devops",
      "web-scraping",
      "github",
      "Heroku"
    ],
    "displayTags": [
      "Python",
      "Discord API",
      "CI/CD",
      "Web Scraping"
    ],
    "categories": [
      "swe"
    ],
    "heading": "A Discord bot for memes and the community",
    "description": "A Discord bot that streamlines server moderation, aiding in community management. Its web scraping capabilities, powered by Beautiful Soup, integrate iFunny content into Discord channels. Hosted on Heroku and supported by a CI/CD pipeline through GitHub Actions, this bot enhances Discord server functionality.",
    "thumbnail": "discord-bot-logo.png",
    "rank": 5
  },
  {
    "title": "Social Student's Stats",
    "link": "#",
    "tags": [
      "python",
      "twitter",
      "nlp",
      "tensorflow",
      "api",
      "data-mining"
    ],
    "displayTags": [
      "Python",
      "NLP",
      "Twitter"
    ],
    "categories": [
      "swe",
      "ml"
    ],
    "heading": "A Research project to qunatify users' social media impact",
    "description": "A collaborative project with a professor to develop a sophisticated statistical model for quantifying social media presence. This model computes personalized sociability scores and inter-user homophily. Advanced data mining techniques and Recurrent neural networks were used to analyze over 5000 user profiles, enhancing the model's accuracy.",
    "thumbnail": "stu-soc-stat-logo.svg",
    "rank": 4
  },
  {
    "title": "Insta-Diagnosis",
    "link": "https://github.com/hardik-kapadia/Insta-diagnosis",
    "tags": [
      "python",
      "django",
      "auth",
      "tensorflow",
      "cnn",
      "opencv",
      "medical",
      "image-processing"
    ],
    "displayTags": [
      "Python",
      "Django",
      "Tensorflow",
      "Image Processing"
    ],
    "categories": [
      "swe",
      "ml"
    ],
    "heading": "A web application designed to predict the presence of a specific disease based on medical scan analysis ",
    "description": "A web application for disease prediction, leveraging medical scan analysis. It incorporates user authentication and secure data storage using SQLite, managing user profiles and medical records. The image pre-processing pipeline, optimized with OpenCV, enhances the accuracy of Convolutional Neural Networks in detecting diseases from medical scans",
    "thumbnail": "doc-logo.jpg",
    "rank": 3
  },
  {
    "title": "Web Crawler",
    "link": "https://github.com/hardik-kapadia/Image-WebCrawler-servlet",
    "tags": [
      "java",
      "servlet",
      "jsoup",
      "server",
      "api",
      "web-scraping",
      "multhithreading"
    ],
    "displayTags": [
      "Java",
      "Web Scraping",
      "Servlet",
      "Multi=threading"
    ],
    "categories": [
      "swe"
    ],
    "heading": "A multi-threaded web crawler to extract images from websites and their subpages",
    "description": "A multi-threaded web crawler to extract images from websites and their subpages. The crawler utilizes Java’s concurrent programming capabilities, implementing recursive job creation and asynchronous processing to efficiently handle multiple URLs, optimizing both performance and resource management. Additionally, URL filtering mechanisms and depth/URL limits were designed to ensure focused crawling within specified domains while preventing resource overuse",
    "thumbnail": "web-crawler-logo.png",
    "rank": 1
  }
]